src/InformationRegisters/БЗ_СостояниеСтатейБазыЗнаний/БЗ_СостояниеСтатейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_СостояниеСтатейБазыЗнаний</name>
  <resources>
    <name>ВыдалНаИзучение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ВыданаНаИзучение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>БылаОткрыта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Изучена</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПровереноИзучение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокИзучения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяБазыЗнаний</name>
    <type>
      <types>CatalogRef.БЗ_СтатьиБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БЗ_СостояниеСтатейБазыЗнаний/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр <> Неопределено Тогда
		Элементы.Список.ТолькоПросмотр = Параметры.ТолькоПросмотр;
	КонецЕсли;
	
	Если Параметры.Свойство("Категория") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Категория", Параметры.Категория);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Категория", Справочники.БЗ_КатегорииБазыЗнаний.ПустаяСсылка());
	КонецЕсли;
	
	Если Параметры.Свойство("Пользователь") Тогда
		Элементы.Пользователь.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Пользователь", Параметры.Пользователь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	РегистрыСведений.БЗ_СостояниеСтатейБазыЗнаний.УстановитьУсловноеОформлениеСписка(Список.УсловноеОформление.Элементы);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Список.ТолькоПросмотр Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			ПоказатьЗначение(, ТекДанные.СтатьяБазыЗнаний);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
